1. Continuaremos trabajando con nuestros datos de supermercado. Para esto cargaremos los 4 archivos (clientes, boletas, detalle y productos) y responderemos las siguientes preguntas

In [1]:
import pandas as pd


# Definir las rutas de los archivos
ruta_clientes = './datos/clientes.csv'
ruta_productos = './datos/productos.csv'
ruta_boletas = './datos/boletas.csv'
ruta_detalle = './datos/detalle.csv'

# Cargar los datos en DataFrames
df_clientes = pd.read_csv(ruta_clientes)
df_productos = pd.read_csv(ruta_productos)
df_boletas = pd.read_csv(ruta_boletas)
df_detalle = pd.read_csv(ruta_detalle)

a.  Generar un dataframe con cada archivo.
b. Cuantos datos tiene cada dataframe?

In [2]:
# Mostrar DataFrames
print(df_clientes.head())

# Imprimir el número total de datos en cada DataFrame
print(f"El DataFrame df_productos tiene {df_clientes.shape[0]} filas y {df_clientes.shape[1]} columnas. Dando un número total de datos: { df_clientes.size }")

          rut           nombre              direccion       comuna  \
0  11223344-4    Tomás Ramírez                    NaN        Arica
1  11223344-5      Laura Rojas      Calle Virtual 567  Antofagasta
2  12345678-9       Juan Perez        Calle Falsa 123     Santiago
3  23456789-1  Pedro Rodríguez                    NaN   Valparaíso
4  33445566-5    Camila Torres  Calle Cibernética 456          NaN

  fecha_nacimiento     telefono               email
0       1994-12-31          NaN   tomas@example.com
1       1998-07-12  945678321.0   laura@example.com
2       2000-05-15  912345678.0    juan@example.com
3       1988-03-10  912345678.0   pedro@example.com
4       1993-02-14  977894512.0  camila@example.com
El DataFrame df_productos tiene 20 filas y 7 columnas. Dando un número total de datos: 140

In [3]:
# Mostrar DataFrames
print(df_productos.head())

# Imprimir el número de datos
print(f"El DataFrame df_productos tiene {df_productos.shape[0]} filas y {df_productos.shape[1]} columnas. Dando un total de datos  : {df_productos.size}")

   codigo            nombre  precio
0     101             Arroz    1500
1     102            Fideos    1200
2     103  Aceite de cocina   18000
3     104            Harina    2000
4     105             Leche    3000
El DataFrame df_productos tiene 20 filas y 3 columnas. Dando un total de datos  : 60

In [4]:
# Mostrar DataFrames
print(df_boletas.head())

# Imprimir el número de datos
print(f"El DataFrame df_boletas tiene {df_boletas.shape[0]} filas y {df_boletas.shape[1]} columnas. Dando un total de datos  : {df_boletas.size}")

   numero       fecha rut_cliente
0       1  2023-11-05  12345678-9
1       2  2023-11-07  87654321-0
2       3  2023-11-09  23456789-1
3       4  2023-11-12  34567890-2
4       5  2023-11-15  45678901-3
El DataFrame df_boletas tiene 24 filas y 3 columnas. Dando un total de datos  : 72

In [5]:
# Mostrar DataFrames
print(df_detalle.head())

# Imprimir el número de datos
print(f"El DataFrame df_detalle tiene {df_detalle.shape[0]} filas y {df_detalle.shape[1]} columnas. Dando un total de datos  : {df_detalle.size}")

   numero_boleta  codigo_producto  cantidad
0              1              101         3
1              1              103         6
2              1              106         2
3              2              102         5
4              2              104         1
El DataFrame df_detalle tiene 40 filas y 3 columnas. Dando un total de datos  : 120

c.  Cuantos clientes no tienen email?

In [6]:
# Contar el número de clientes sin correo electrónico
num_sin_email = df_clientes['email'].isna().sum()

# Imprimir el número de clientes sin correo electrónico
print(f"El número de clientes sin correo electrónico es: {num_sin_email}")

El número de clientes sin correo electrónico es: 4

d. Genera un filtro para saber a qué clientes les falta un dato (cualquiera).
e.  A cuantos clientes les faltan datos?

In [7]:
# Generar un filtro para los clientes que tienen al menos un dato faltante
filtro_datos_faltantes = df_clientes.isna().any(axis=1)

# Aplicar el filtro al DataFrame
clientes_datos_faltantes = df_clientes[filtro_datos_faltantes]

# Mostrar los clientes con datos faltantes
print(clientes_datos_faltantes)

# Contar el número de productos con al menos un dato nulo
print(f'La cantidad de clientes con al menos un dato nulo es: {len(clientes_datos_faltantes)}')

           rut             nombre                direccion        comuna  \
0   11223344-4      Tomás Ramírez                      NaN         Arica
3   23456789-1    Pedro Rodríguez                      NaN    Valparaíso
4   33445566-5      Camila Torres    Calle Cibernética 456           NaN
5   33445566-7         Mateo Diaz                      NaN  Viña del Mar
6   34567890-2     Carla González      Calle Inventada 789           NaN
7   45678901-3     Diego Martínez       Avenida Irreal 987     La Serena
8   55667788-6      Matias Castro   Avenida Innovación 321           NaN
9   55667788-9  Valentina Herrera  Avenida Tecnológica 123           NaN
10  56789012-4          Ana Lopez                      NaN           NaN
11  67890123-5    Luisa Fernández       Calle Ficticia 321      Rancagua
12  77889900-1       Martin Gómez                      NaN       Iquique
13  77889900-7      Renata Flores                      NaN       Copiapó
14  78901234-6      Javier Torres   Avenida de Ensueño 654        Temuco
16  89012345-7      Marta Ramírez         Calle Soñada 210           NaN
17  90123456-8       Daniel Silva                      NaN  Puerto Montt
18  99001122-3        Sofía Pérez        Calle Digital 789           NaN
19  99001122-8       Nicolás Ruiz   Calle Programación 210           NaN

   fecha_nacimiento     telefono                  email
0        1994-12-31          NaN      tomas@example.com
3        1988-03-10  912345678.0      pedro@example.com
4        1993-02-14  977894512.0     camila@example.com
5        2002-02-28  967894512.0      mateo@example.com
6        1999-12-05  934567890.0      carla@example.com
7               NaN          NaN      diego@example.com
8        1992-06-08  923478965.0                    NaN
9        1997-04-05  923478965.0  valentina@example.com
10       1990-08-18  978901234.0        ana@example.com
11       2005-04-25          NaN      luisa@example.com
12       1996-10-17  955678902.0     martin@example.com
13              NaN          NaN     renata@example.com
14       1985-11-30  923456789.0                    NaN
16              NaN          NaN                    NaN
17              NaN          NaN                    NaN
18       2001-09-22  912345672.0      sofia@example.com
19       2003-11-03  955678902.0    nicolas@example.com
La cantidad de clientes con al menos un dato nulo es: 17

f.  Agregar una nueva columna a todos los clientes, que indique si le falta algún dato o no (con un mapeo).

In [8]:
# Agregar una nueva columna que indique si a un cliente le falta algún dato
df_clientes['datos_faltantes'] = df_clientes.isna().any(axis=1).map({True: 'Falta dato', False: 'Datos completos'})

# Mostrar el DataFrame con la nueva columna
print(df_clientes)

           rut             nombre                direccion        comuna  \
0   11223344-4      Tomás Ramírez                      NaN         Arica
1   11223344-5        Laura Rojas        Calle Virtual 567   Antofagasta
2   12345678-9         Juan Perez          Calle Falsa 123      Santiago
3   23456789-1    Pedro Rodríguez                      NaN    Valparaíso
4   33445566-5      Camila Torres    Calle Cibernética 456           NaN
5   33445566-7         Mateo Diaz                      NaN  Viña del Mar
6   34567890-2     Carla González      Calle Inventada 789           NaN
7   45678901-3     Diego Martínez       Avenida Irreal 987     La Serena
8   55667788-6      Matias Castro   Avenida Innovación 321           NaN
9   55667788-9  Valentina Herrera  Avenida Tecnológica 123           NaN
10  56789012-4          Ana Lopez                      NaN           NaN
11  67890123-5    Luisa Fernández       Calle Ficticia 321      Rancagua
12  77889900-1       Martin Gómez                      NaN       Iquique
13  77889900-7      Renata Flores                      NaN       Copiapó
14  78901234-6      Javier Torres   Avenida de Ensueño 654        Temuco
15  87654321-0      Maria Sánchez   Avenida Imaginaria 456    Concepción
16  89012345-7      Marta Ramírez         Calle Soñada 210           NaN
17  90123456-8       Daniel Silva                      NaN  Puerto Montt
18  99001122-3        Sofía Pérez        Calle Digital 789           NaN
19  99001122-8       Nicolás Ruiz   Calle Programación 210           NaN

   fecha_nacimiento     telefono                  email  datos_faltantes
0        1994-12-31          NaN      tomas@example.com       Falta dato
1        1998-07-12  945678321.0      laura@example.com  Datos completos
2        2000-05-15  912345678.0       juan@example.com  Datos completos
3        1988-03-10  912345678.0      pedro@example.com       Falta dato
4        1993-02-14  977894512.0     camila@example.com       Falta dato
5        2002-02-28  967894512.0      mateo@example.com       Falta dato
6        1999-12-05  934567890.0      carla@example.com       Falta dato
7               NaN          NaN      diego@example.com       Falta dato
8        1992-06-08  923478965.0                    NaN       Falta dato
9        1997-04-05  923478965.0  valentina@example.com       Falta dato
10       1990-08-18  978901234.0        ana@example.com       Falta dato
11       2005-04-25          NaN      luisa@example.com       Falta dato
12       1996-10-17  955678902.0     martin@example.com       Falta dato
13              NaN          NaN     renata@example.com       Falta dato
14       1985-11-30  923456789.0                    NaN       Falta dato
15       1995-10-20  987654321.0      maria@example.com  Datos completos
16              NaN          NaN                    NaN       Falta dato
17              NaN          NaN                    NaN       Falta dato
18       2001-09-22  912345672.0      sofia@example.com       Falta dato
19       2003-11-03  955678902.0    nicolas@example.com       Falta dato

g. A todos los clientes que les falten datos, deben rellenarse con un S/I, excepto la fecha de nacimiento.

In [9]:
# Seleccionar todas las columnas excepto la fecha de nacimiento
columnas_sin_fecha = [col for col in df_clientes.columns if col != 'fecha_nacimiento']

# Rellenar los datos faltantes con 'S/I' en las columnas seleccionadas
df_clientes[columnas_sin_fecha] = df_clientes[columnas_sin_fecha].fillna('S/I')

# Mostrar el DataFrame con los datos faltantes rellenados
print(df_clientes)

           rut             nombre                direccion        comuna  \
0   11223344-4      Tomás Ramírez                      S/I         Arica
1   11223344-5        Laura Rojas        Calle Virtual 567   Antofagasta
2   12345678-9         Juan Perez          Calle Falsa 123      Santiago
3   23456789-1    Pedro Rodríguez                      S/I    Valparaíso
4   33445566-5      Camila Torres    Calle Cibernética 456           S/I
5   33445566-7         Mateo Diaz                      S/I  Viña del Mar
6   34567890-2     Carla González      Calle Inventada 789           S/I
7   45678901-3     Diego Martínez       Avenida Irreal 987     La Serena
8   55667788-6      Matias Castro   Avenida Innovación 321           S/I
9   55667788-9  Valentina Herrera  Avenida Tecnológica 123           S/I
10  56789012-4          Ana Lopez                      S/I           S/I
11  67890123-5    Luisa Fernández       Calle Ficticia 321      Rancagua
12  77889900-1       Martin Gómez                      S/I       Iquique
13  77889900-7      Renata Flores                      S/I       Copiapó
14  78901234-6      Javier Torres   Avenida de Ensueño 654        Temuco
15  87654321-0      Maria Sánchez   Avenida Imaginaria 456    Concepción
16  89012345-7      Marta Ramírez         Calle Soñada 210           S/I
17  90123456-8       Daniel Silva                      S/I  Puerto Montt
18  99001122-3        Sofía Pérez        Calle Digital 789           S/I
19  99001122-8       Nicolás Ruiz   Calle Programación 210           S/I

   fecha_nacimiento     telefono                  email  datos_faltantes
0        1994-12-31          S/I      tomas@example.com       Falta dato
1        1998-07-12  945678321.0      laura@example.com  Datos completos
2        2000-05-15  912345678.0       juan@example.com  Datos completos
3        1988-03-10  912345678.0      pedro@example.com       Falta dato
4        1993-02-14  977894512.0     camila@example.com       Falta dato
5        2002-02-28  967894512.0      mateo@example.com       Falta dato
6        1999-12-05  934567890.0      carla@example.com       Falta dato
7               NaN          S/I      diego@example.com       Falta dato
8        1992-06-08  923478965.0                    S/I       Falta dato
9        1997-04-05  923478965.0  valentina@example.com       Falta dato
10       1990-08-18  978901234.0        ana@example.com       Falta dato
11       2005-04-25          S/I      luisa@example.com       Falta dato
12       1996-10-17  955678902.0     martin@example.com       Falta dato
13              NaN          S/I     renata@example.com       Falta dato
14       1985-11-30  923456789.0                    S/I       Falta dato
15       1995-10-20  987654321.0      maria@example.com  Datos completos
16              NaN          S/I                    S/I       Falta dato
17              NaN          S/I                    S/I       Falta dato
18       2001-09-22  912345672.0      sofia@example.com       Falta dato
19       2003-11-03  955678902.0    nicolas@example.com       Falta dato

h. Busque en los productos si existe algún outlier.

In [10]:
# Sdf_productos es tu DataFrame y 'precio' es la columna para buscar outliers

# Calcular el IQR para la columna 'precio'
Q1 = df_productos['precio'].quantile(0.25)
Q3 = df_productos['precio'].quantile(0.75)
IQR = Q3 - Q1

# Definir un filtro para los outliers
filtro_outliers = ((df_productos['precio'] < (Q1 - 1.5 * IQR)) | (df_productos['precio'] > (Q3 + 1.5 * IQR)))

# Aplicar el filtro al DataFrame
df_outliers = df_productos[filtro_outliers]

# Mostrar los outliers
print(df_outliers)

   codigo            nombre  precio
2     103  Aceite de cocina   18000

2. El  archivo  “M3E4  - titanic.csv” contiene  información  sobre  los pasajeros  del  Titanic.  Escribir  un  programa  con  los  siguientes requisitos:
a.  Generar un DataFrame con los datos del fichero.

In [11]:
# a. Generar un DataFrame con los datos del fichero.
ruta_titanic = './datos/titanic.csv'
df_titanic = pd.read_csv(ruta_titanic)

# b. Mostrar por pantalla las dimensiones del DataFrame, el número de datos que contiene, los nombres de sus columnas y filas, los tipos de datos de las columnas, las 10 primeras filas y las 10 últimas filas.
print("Dimensiones del DataFrame:", df_titanic.shape)
print("Número de datos que contiene:", df_titanic.size)
print("Nombres de sus columnas:", df_titanic.columns.tolist())
print("Nombres de sus filas:", df_titanic.index.tolist())
print("Tipos de datos de las columnas:", df_titanic.dtypes)
print("Las 10 primeras filas:")
print(df_titanic.head(10))
print("Las 10 últimas filas:")
print(df_titanic.tail(10))

Dimensiones del DataFrame: (891, 12)
Número de datos que contiene: 10692
Nombres de sus columnas: ['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
Nombres de sus filas: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662, 663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675, 676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688, 689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, 700, 701, 702, 703, 704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714, 715, 716, 717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727, 728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740, 741, 742, 743, 744, 745, 746, 747, 748, 749, 750, 751, 752, 753, 754, 755, 756, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766, 767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779, 780, 781, 782, 783, 784, 785, 786, 787, 788, 789, 790, 791, 792, 793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805, 806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818, 819, 820, 821, 822, 823, 824, 825, 826, 827, 828, 829, 830, 831, 832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842, 843, 844, 845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857, 858, 859, 860, 861, 862, 863, 864, 865, 866, 867, 868, 869, 870, 871, 872, 873, 874, 875, 876, 877, 878, 879, 880, 881, 882, 883, 884, 885, 886, 887, 888, 889, 890]
Tipos de datos de las columnas: PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object
Las 10 primeras filas:
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
5            6         0       3
6            7         0       1
7            8         0       3
8            9         1       3
9           10         1       2

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
5                                   Moran, Mr. James    male   NaN      0
6                            McCarthy, Mr. Timothy J    male  54.0      0
7                     Palsson, Master. Gosta Leonard    male   2.0      3
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
5      0            330877   8.4583   NaN        Q
6      0             17463  51.8625   E46        S
7      1            349909  21.0750   NaN        S
8      2            347742  11.1333   NaN        S
9      0            237736  30.0708   NaN        C
Las 10 últimas filas:
     PassengerId  Survived  Pclass                                      Name  \
881          882         0       3                        Markun, Mr. Johann
882          883         0       3              Dahlberg, Miss. Gerda Ulrika
883          884         0       2             Banfield, Mr. Frederick James
884          885         0       3                    Sutehall, Mr. Henry Jr
885          886         0       3      Rice, Mrs. William (Margaret Norton)
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
881    male  33.0      0      0            349257   7.8958   NaN        S
882  female  22.0      0      0              7552  10.5167   NaN        S
883    male  28.0      0      0  C.A./SOTON 34068  10.5000   NaN        S
884    male  25.0      0      0   SOTON/OQ 392076   7.0500   NaN        S
885  female  39.0      0      5            382652  29.1250   NaN        Q
886    male  27.0      0      0            211536  13.0000   NaN        S
887  female  19.0      0      0            112053  30.0000   B42        S
888  female   NaN      1      2        W./C. 6607  23.4500   NaN        S
889    male  26.0      0      0            111369  30.0000  C148        C
890    male  32.0      0      0            370376   7.7500   NaN        Q

c.  Mostrar por pantalla los datos del pasajero con identificador 148.

In [12]:
# Mostrar los datos del pasajero con identificador 148
pasajero_148 = df_titanic.loc[df_titanic['PassengerId'] == 148]
print(pasajero_148)

     PassengerId  Survived  Pclass                              Name     Sex  \
147          148         0       3  Ford, Miss. Robina Maggie "Ruby"  female

     Age  SibSp  Parch      Ticket    Fare Cabin Embarked
147  9.0      2      2  W./C. 6608  34.375   NaN        S

d. Mostrar por pantalla las filas pares del DataFrame

In [13]:
# Mostrar las filas pares del DataFrame
filas_pares = df_titanic.iloc[::2]
print(filas_pares)

     PassengerId  Survived  Pclass  \
0              1         0       3
2              3         1       3
4              5         0       3
6              7         0       1
8              9         1       3
..           ...       ...     ...
882          883         0       3
884          885         0       3
886          887         0       2
888          889         0       3
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
4                             Allen, Mr. William Henry    male  35.0      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
..                                                 ...     ...   ...    ...
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
884                             Sutehall, Mr. Henry Jr    male  25.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
2        0  STON/O2. 3101282   7.9250   NaN        S
4        0            373450   8.0500   NaN        S
6        0             17463  51.8625   E46        S
8        2            347742  11.1333   NaN        S
..     ...               ...      ...   ...      ...
882      0              7552  10.5167   NaN        S
884      0   SOTON/OQ 392076   7.0500   NaN        S
886      0            211536  13.0000   NaN        S
888      2        W./C. 6607  23.4500   NaN        S
890      0            370376   7.7500   NaN        Q

[446 rows x 12 columns]

e.  Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente

In [30]:
# Seleccionar las filas donde 'Pclass' es 1 y ordenar los nombres alfabéticamente
nombres_primera_clase = df_titanic.loc[df_titanic['Pclass'] == 1, 'Name'].sort_values()

# Mostrar los nombres
print(nombres_primera_clase)

730                      Allen, Miss. Elisabeth Walton
305                     Allison, Master. Hudson Trevor
297                       Allison, Miss. Helen Loraine
498    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
460                                Anderson, Mr. Harry
                            ...
155                        Williams, Mr. Charles Duane
351             Williams-Lambert, Mr. Fletcher Fellows
55                                   Woolner, Mr. Hugh
555                                 Wright, Mr. George
325                           Young, Miss. Marie Grice
Name: Name, Length: 216, dtype: object

f.  Mostrar   por   pantalla   el   porcentaje   de   personas   que sobrevivieron y murieron.

In [36]:
# Calcular el porcentaje de personas que sobrevivieron y murieron
porcentaje_sobrevivientes = df_titanic['Survived'].value_counts(normalize=True) * 100

# Mostrar el porcentaje
print(f"Porcentaje de pasajeros que sobrevivieron {int(porcentaje_sobrevivientes[0])} % y que murieron  {int(porcentaje_sobrevivientes[1])} %:")

Porcentaje de pasajeros que sobrevivieron 61 % y que murieron  38 %:

g. Mostrar   por   pantalla   el   porcentaje   de   personas   que sobrevivieron en cada clase

In [38]:
# Calcular el porcentaje de personas que sobrevivieron en cada clase
porcentaje_sobrevivientes_clase = df_titanic.groupby('Pclass')['Survived'].mean() * 100

# Mostrar el porcentaje
print(porcentaje_sobrevivientes_clase)

Pclass
1    62.962963
2    47.282609
3    24.236253
Name: Survived, dtype: float64

h. Eliminar del DataFrame los pasajeros con edad desconocida.

In [40]:
# Eliminar los pasajeros con edad desconocida
df_titanic_sin_edad_desconocida = df_titanic.dropna(subset=['Age'])

# Mostrar el nuevo DataFrame
print(df_titanic_sin_edad_desconocida)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
120          121         0       2
122          123         0       2
123          124         1       2
124          125         0       1
125          126         1       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
120                        Hickman, Mr. Stanley George    male  21.0      2
122                               Nasser, Mr. Nicholas    male  32.5      1
123                                Webber, Miss. Susan  female  32.5      0
124                        White, Mr. Percival Wayland    male  54.0      0
125                       Nicola-Yarred, Master. Elias    male  12.0      1

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
120      0      S.O.C. 14879  73.5000   NaN        S
122      0            237736  30.0708   NaN        C
123      0             27267  13.0000  E101        S
124      1             35281  77.2875   D26        S
125      0              2651  11.2417   NaN        C

[100 rows x 12 columns]

i.   Mostrar por pantalla la edad media de las mujeres que viajaban en cada clase

In [42]:
# Seleccionar las filas donde 'Sex' es 'female' y calcular la edad media en cada clase
edad_media_mujeres = df_titanic[df_titanic['Sex'] == 'female'].groupby('Pclass')['Age'].mean()

# Redondear a 0 decimales y convertir a int
edad_media_mujeres = edad_media_mujeres.round(0).astype(int)

# Mostrar la edad media
print(edad_media_mujeres)

Pclass
1    35
2    29
3    22
Name: Age, dtype: int32

j.   Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.

In [43]:
# Añadir una nueva columna 'Menor_de_edad' que es True si 'Age' es menor que 18 y False en caso contrario
df_titanic['Menor_de_edad'] = df_titanic['Age'].apply(lambda x: True if x < 18 else False)

# Mostrar el DataFrame
print(df_titanic)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked  Menor_de_edad
0        0         A/5 21171   7.2500   NaN        S          False
1        0          PC 17599  71.2833   C85        C          False
2        0  STON/O2. 3101282   7.9250   NaN        S          False
3        0            113803  53.1000  C123        S          False
4        0            373450   8.0500   NaN        S          False
..     ...               ...      ...   ...      ...            ...
886      0            211536  13.0000   NaN        S          False
887      0            112053  30.0000   B42        S          False
888      2        W./C. 6607  23.4500   NaN        S          False
889      0            111369  30.0000  C148        C          False
890      0            370376   7.7500   NaN        Q          False

[891 rows x 13 columns]

k.  Mostrar por pantalla el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

In [44]:
# Calcular el porcentaje de menores y mayores de edad que sobrevivieron en cada clase
porcentaje_sobrevivientes_edad = df_titanic.groupby(['Pclass', 'Menor_de_edad'])['Survived'].mean() * 100

# Mostrar el porcentaje
print(porcentaje_sobrevivientes_edad)

Pclass  Menor_de_edad
1       False            61.274510
        True             91.666667
2       False            40.993789
        True             91.304348
3       False            21.791768
        True             37.179487
Name: Survived, dtype: float64